artillery/web.yaml
config:
  target: "http://localhost:90"
  phases:
    - duration: 300
      arrivalRate: 2
      rampTo: 50
  # environments:
  #   dev:
  #     target: "http://localhost:90/"
  #     phases:
  #       - arrivalRate: 10
  #         duration: 60
  #   prod:
  #     target: "https://service-foo.preprod.acmecorp.digital"
scenarios:
  - name: Create record
    flow:
      - get:
          url: "/c/14/selecao"
      - get:
          url: "/c/13/smartwatch"
      - get:
          url: "/c/12/brinquedos-eletronicos"
      - get:
          url: "/c/10/jogos"
      - get:
          url: "/c/14/selecao"
      - get:
          url: "/c/7/biking"
      - get:
          url: "/c/6/ar-livre"
      - get:
          url: "/c/8/futebol"